## 🧾 Terraform Plan for `iam_user`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.john_doe_user_details_advanced.aws_iam_access_key.this[0] will be created
  + resource "aws_iam_access_key" "this" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + pgp_key                        = (sensitive value)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "John_Doe"
    }

  # module.john_doe_user_details_advanced.aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "John_Doe"
      + path          = "/users/john_doe/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.john_doe_user_details_advanced.aws_iam_user_group_membership.this will be created
  + resource "aws_iam_user_group_membership" "this" {
      + groups = [
          + "Administrators",
        ]
      + id     = (known after apply)
      + user   = "John_Doe"
    }

  # module.john_doe_user_details_advanced.aws_iam_user_login_profile.this[0] will be created
  + resource "aws_iam_user_login_profile" "this" {
      + encrypted_password      = (known after apply)
      + id                      = (known after apply)
      + key_fingerprint         = (known after apply)
      + password                = (known after apply)
      + password_length         = 16
      + password_reset_required = false
      + pgp_key                 = (sensitive value)
      + user                    = "John_Doe"
    }

  # module.john_doe_user_details_basic.aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "John_Doe"
      + path          = "/users/john_doe/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.john_doe_user_details_basic.aws_iam_user_group_membership.this will be created
  + resource "aws_iam_user_group_membership" "this" {
      + groups = [
          + "Administrators",
        ]
      + id     = (known after apply)
      + user   = "John_Doe"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->